Autodesk.Revit.DB.ICentralLockedCallbackProxy.ShouldWaitForLockAvailability
Returns whether Revit should wait and try again to acquire the lock on central.
Returns:
True means wait and try again later.  False means immediately give up.
Since:
2014